[
  {
    "All Blue Plaques in Leeds": "No",
    "": "Title",
    "__1": "Location",
    "__2": "Unveiler",
    "__3": "Date",
    "__4": "Sponsor",
    "__5": "Easting",
    "__6": "Northing",
    "__7": "What it Says"
  },
  {
    "All Blue Plaques in Leeds": 1,
    "": "Burley Bar Stone",
    "__1": "Inside main entrance of Leeds Building Society, The Headrow Leeds 1",
    "__2": "Lord Marshall of Leeds, President of Leeds Civic Trust,  former Leader of Leeds City Council",
    "__3": "27 Nov ‘87",
    "__4": "Leeds & Holbeck Building Society",
    "__5": 430055,
    "__6": 433766,
    "__7": "This stone, now housed inside the main entrance of Leeds Building society marked the medieval boundary between the manorial borough, or town, of Leeds and Leeds Main Riding, the surrounding agricultural land. First recorded 1726."
  },
  {
    "All Blue Plaques in Leeds": 2,
    "": "Louis Le Prince (1st Plaque)",
    "__1": "British Waterways, Leeds Bridge, Lower Briggate, Leeds 1",
    "__2": "Mr. William Le Prince Huettle, great-grandson of Louis Le Prince",
    "__3": "13 Oct ‘88",
    "__4": "British Waterways Board",
    "__5": 430296,
    "__6": 433148,
    "__7": "Louis Aime August Le Prince came to Leeds in 1866 where he experimented in cinematography. In 1888 he patented a one-lens camera which he filmed Leeds Bridge from the British Waterways building. These were probably the world's first successful moving pictures."
  },
  {
    "All Blue Plaques in Leeds": 3,
    "": "Louis Le Prince (2nd Plaque)",
    "__1": "BBC Studios, Woodhouse Lane, Leeds 2",
    "__2": "Sir Richard Attenborough, Actor, Broadcaster and Film Director",
    "__3": "14 Oct ‘88",
    "__4": "British Broadcasting Corporation",
    "__5": "",
    "__6": "",
    "__7": "Not found"
  },
  {
    "All Blue Plaques in Leeds": 4,
    "": "Temple Mill",
    "__1": "Marshall Street, Leeds 11",
    "__2": "Mr Bruce Taylor",
    "__3": "14 Feb ‘89",
    "__4": "Kay & Company Ltd",
    "__5": 429559,
    "__6": 432749,
    "__7": "The magnificent but highly functional flax spinning mill to your left was erected by John Marshall, founder of the Leeds flax industry.  Joseph Bonomi modelled the mill and this office building (added in 1843) on the Egytian temple at Edfu.  Erected in 1838-40."
  },
  {
    "All Blue Plaques in Leeds": 5,
    "": "18 Park Place",
    "__1": "18 Park Place, Leeds 1",
    "__2": "Sir Christopher Benson, Chairman, MEPC plc",
    "__3": "24 Feb ‘89",
    "__4": "MEPC plc",
    "__5": 429533,
    "__6": 433600,
    "__7": "This house, restored to its former grandeur by MEPC plc in 1988, is situated in one of the most elegant streets of Georgian Leeds. Merchants and gentlemen were attraced here by the beautiful view of the river and neighbouring hills."
  },
  {
    "All Blue Plaques in Leeds": 6,
    "": "The Victoria Hotel",
    "__1": "Great George Street, Leeds 1",
    "__2": "Mr John Power MBE, Deputy Lord Lieutenant of West Yorkshire",
    "__3": "25 Apr ‘89",
    "__4": "Joshua Tetley & Sons Ltd",
    "__5": 429750,
    "__6": 433920,
    "__7": "Was Built in 1865 to serve people attending the Assize Courts newly held at Leeds Town Hall. Its Stylish accommodation then comprised spacious dining rooms and bars, a billiard room, private sitting rooms and 28 bedrooms."
  },
  {
    "All Blue Plaques in Leeds": 7,
    "": "The Assembly Rooms",
    "__1": "Crown Street, Leeds 2",
    "__2": "Mr Bettison (Senior)",
    "__3": "27 Apr ‘89",
    "__4": "Mr Bruce Bettison, then Owner of Waterloo Antiques",
    "__5": 430456,
    "__6": 433362,
    "__7": "Its Handsomely decorated ballroom and card rooms made it one of Yorkshire's finest assembly rooms. Its patrons were the Leeds merchants and the local nobility and gentry. The ground floor formed the Northern range of the third white Cloth Hall. Opened 9th"
  },
  {
    "All Blue Plaques in Leeds": 8,
    "": "Kemplay’s Academy",
    "__1": "Nash’s Tudor Fish Restaurant, off New Briggate, Leeds 1",
    "__2": "Mr. Lawrence Bellhouse, Proprietor, Nash’s Tudor Fish Restaurant",
    "__3": "May ‘89",
    "__4": "Lawrence Bellhouse,  Proprietor, Nash’s Tudor Fish Restaurant",
    "__5": 430290,
    "__6": 433880,
    "__7": "This fine house built in 1720 for Matthew Wilson is shown on John Cossin's plan of Leeds in 1725. In 1817 Richard Kemplay purchased the property to house his 'Academy for Young Gentlemen.'"
  },
  {
    "All Blue Plaques in Leeds": 9,
    "": "Brodrick’s Buildings",
    "__1": "Cookridge Street, Leeds 2",
    "__2": "Mr John M. Quinlan, Director, Trinity Services",
    "__3": "20 Jul ‘89",
    "__4": "Trinity Services (Developers)",
    "__5": 429914,
    "__6": 434054,
    "__7": "These fine shops and offices were designed by Cuthbert Brodrick (1822-1905) the architect of Leeds Town Hall and the Corn Exchange and the Mechanics' Institute. They were renvovated by Trinity Services in 1988. ERECTED 1864"
  },
  {
    "All Blue Plaques in Leeds": 10,
    "": "The West Bar",
    "__1": "Bond Street Centre, Boar Lane, Leeds 1",
    "__2": "Councillor J.L. Carter, Lord Mayor of Leeds",
    "__3": "19 Sept ‘89",
    "__4": "Bond Street Shopping Centre Merchants’ Association",
    "__5": 429999,
    "__6": 433396,
    "__7": "The bar stone making the western boundary of the built-up area of the medieval town of Leeds stood here. Scarcely a single building lay in the old manorial park to the West of this point before 1758."
  },
  {
    "All Blue Plaques in Leeds": 11,
    "": "Park Square",
    "__1": "45 Park Square, Leeds 1",
    "__2": "Mr. Anthony Blackmore, Senior Partner, Simpson Curtis, Solicitors",
    "__3": "21 Sept ‘89",
    "__4": "Simpson Curtis Solicitors",
    "__5": 429668,
    "__6": 433744,
    "__7": "This elegant square formed part of the Wilson family's plan to create a high-class residential estate on the site of the medieval park of the Manor of Leeds. Its residents were merchants, clergy, lawyers and surgeons. Built 1788-1810"
  },
  {
    "All Blue Plaques in Leeds": 12,
    "": "Leeds Manor House",
    "__1": "Scarborough Hotel Bishopsgate Street,    Leeds 1",
    "__2": "Professor Maurice Beresford, , Doyen of Leeds Historians.",
    "__3": "26 Sept ‘89",
    "__4": "Joshua Tetley & Sons Ltd",
    "__5": 429978,
    "__6": 433320,
    "__7": "The Medieval manor house stood here on 'Castle Hill.' Its deep moat looped between the river and Boar Lane. Richard Wilson lavishly rebuilt it in 1765 and in 1821 it became Henry Scarebrough's hotel. The present-day pub is a survivng extension."
  },
  {
    "All Blue Plaques in Leeds": 13,
    "": "St Paul’s House",
    "__1": "St Paul’s House, Park Square, Leeds 1",
    "__2": "Mr K.E. Reynolds, Branch Manager of the Fire Society",
    "__3": "3 Oct ‘89",
    "__4": "Norwich Union Insurance Group",
    "__5": 429582,
    "__6": 433674,
    "__7": "This building was originally a warehouse and cloth-cutting works built for John Barran, the founder of the mass-production, ready-made clothing industry in Leeds. Barran was a Mayor of Leeds and served as its Liberal M.P. from 1876-1885. Architect: Thomas Ambler. Erected 1878"
  },
  {
    "All Blue Plaques in Leeds": 14,
    "": "Leeds Charity School",
    "__1": "Mark Lane, Leeds 2",
    "__2": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__3": "30 Oct ‘89",
    "__4": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__5": 430210,
    "__6": 433820,
    "__7": "The Chapel of Harrison's almshouses which formerly occupied this site, was converted for use by the charity school in 1726. When the present building was erected in 1815, the institution clothed 80 poor girls and trained them for domestic service. Founded 1705"
  },
  {
    "All Blue Plaques in Leeds": 15,
    "": "Hotel Metropole",
    "__1": "King Street, Leeds 1",
    "__2": "Lord Strathclyde, Minister for Tourism",
    "__3": "10 Nov ‘89",
    "__4": "Crown Hotels",
    "__5": 429715,
    "__6": 433462,
    "__7": "The fine hotel designed by Chorley, Connon and Chorley is one of the best examples of terracotta work in Leeds. A remarkable feature is the large stone cupold taken from the town's fourth elite Cloth Hall (erected in 1868) which formerly occupied this site. Opened 1899."
  },
  {
    "All Blue Plaques in Leeds": 16,
    "": "Yorkshire Penny Bank",
    "__1": "Yorkshire Bank plc, Infirmary Street, Leeds 1",
    "__2": "Mr. David Mortimer, Controller (Marketing), Yorkshire Bank",
    "__3": "1 Feb ‘90",
    "__4": "Yorkshire Bank plc",
    "__5": 429820,
    "__6": 433550,
    "__7": "This famous bank, later known as Yorkshire bank, was founded in Leeds in 1856. These flamboyant premises, designed by G. B. Bulmer, were opened in 1894. the first purpose-built Leeds general Infirmary (1771) formerly stood on this site."
  },
  {
    "All Blue Plaques in Leeds": 17,
    "": "William Hey's House",
    "__1": "Albion Place, Leeds 1",
    "__2": "Private unveiling",
    "__3": "March ‘90",
    "__4": "Leeds Law Society",
    "__5": 430080,
    "__6": 433609,
    "__7": "This impressive Georgian townhouse was built for William Hey (1736-1819) one of the founders and later Chief Surgeon of Leeds General Infirmary. For 50 years Hey was in the front rank of British surgeons. Architect: Thomas Johnson, Erected 1794-5."
  },
  {
    "All Blue Plaques in Leeds": 18,
    "": "Leeds Infirmary",
    "__1": "Leeds General Infirmary, Great George Street, Leeds 1",
    "__2": "Professor Neville Rowel MD, FRCP, Vice-President, Leeds Civic Trust",
    "__3": "12 Mar ‘90",
    "__4": "Medical Faculty of the General Infirmary at Leeds",
    "__5": 429750,
    "__6": 433970,
    "__7": "This General Infirmary moved here from Infirmary Street in 1869. The building, designed by George Gilbert Scott, incorporated ideas from Florence Nightingale. The plan placed it  the foremost rank of European Hospitals."
  },
  {
    "All Blue Plaques in Leeds": 19,
    "": "Leeds School of Medicine",
    "__1": "Thoresby Place, Leeds 1",
    "__2": "Professor M.S. Losowsky, Dean of the Faculty of Medicine and Professor of Medicine, The University of Leeds",
    "__3": "3 Apr ‘90",
    "__4": "Faculty of Medicine, University of Leeds",
    "__5": 429560,
    "__6": 434080,
    "__7": "The institution founded in 1831, was one of the first provincial medical schools in England. The move here from Park Street in 1894 provided the school with its second purpose-built premises. Architect: W.H. Thorp. Erected: 1891-94"
  },
  {
    "All Blue Plaques in Leeds": 20,
    "": "Queens Court",
    "__1": "Queens Court, Lower Briggate, Leeds 1",
    "__2": "Mr. Brian Prideaux, Property Developer",
    "__3": "2 May ‘90",
    "__4": "Brian Prideaux, Property Developer",
    "__5": 430276,
    "__6": 433294,
    "__7": "The historic courtyard occupies one of the 60 burgage plots which abutted Briggate in the Middle Ages. It is fronted by an eight-bayed woollen cloth merchant's house (built c.1714) and contains the merchant's cloth finishing shop and warehouses."
  },
  {
    "All Blue Plaques in Leeds": 21,
    "": "Leeds & Liverpool Canal Warehouse",
    "__1": "Canal Basin, Water Lane, Leeds 11",
    "__2": "Mr. Len Davis,  Leeds Canal Basin (Development) Ltd",
    "__3": "3 May ‘90",
    "__4": "Len Davis, Leeds Canal Basin (Development) Ltd",
    "__5": 429841,
    "__6": 433038,
    "__7": "In 1777 this robust stone building was constructed as a terminal warehouse for the Leeds Liverpool Canal. Started in 1770, the Canal was finally completed in 1816 at a cost of £1,200,00 nearly five times the original estimate."
  },
  {
    "All Blue Plaques in Leeds": 22,
    "": "Bank of England",
    "__1": "South Parade, Leeds 1",
    "__2": "Councillor Les Carter, Lord Mayor of Leeds",
    "__3": "11 May ‘90",
    "__4": "Bank of England",
    "__5": 429927,
    "__6": 433752,
    "__7": "The Bank of England opened a branch in Leeds in 1827. These premises, entered from South Parade, were designed by Philip Hardwick and erected 1862-64. The Bank remained on this site until moving to King Street in 1971."
  },
  {
    "All Blue Plaques in Leeds": 23,
    "": "A.S.L.E. & F.",
    "__1": "The Commercial Inn, Sweet Street, Leeds 11",
    "__2": "Mr. Derrick Fullick, General Secretary, A.S.L.E. & F.",
    "__3": "17 Jan ‘91",
    "__4": "A.S.L.E. & F.",
    "__5": 429584,
    "__6": 432558,
    "__7": "The Associated Society of Locomotive Engineers and Firemen was founded in 1880. Because of the convenience and importance of Leeds as a railway centre, the Society established its first registered office here at the Commercial Inn, Sweet Street in 1881."
  },
  {
    "All Blue Plaques in Leeds": 24,
    "": "The Great Synagogue",
    "__1": "Belgrave Street, Leeds 2",
    "__2": "Rabbi Dr Solomon Brown",
    "__3": "3 Feb ‘91",
    "__4": "The United Hebrew Congregation",
    "__5": 430290,
    "__6": 433990,
    "__7": "In 1860 the first purpose-built synagogue in Yorkshire since the expulsion of the Jews from England in 1290 was erected here. Until 1983 it served the Jewish Community, which had settled in the Leylands (between North Street and Regent Street) in the 19th Century"
  },
  {
    "All Blue Plaques in Leeds": 25,
    "": "Mill Hill Chapel and Joseph Priestley",
    "__1": "Mill Hill Chapel, corner of Park Row and City Square, Leeds 1",
    "__2": "Mrs Eila Forrester, President of the General Assembly of Victorian and Free Christian Churches",
    "__3": "28 Mar ‘91",
    "__4": "Leeds & Holbeck Building Society",
    "__5": 429955,
    "__6": 433467,
    "__7": "This elegant Gothic building designed by Bowman and Crowthern in 1848, replaced the original 17th century chapel. Its Congregation formerly Presbyterian, now Unitarian-dates from 1672. Joseph Priestley, LL.D, F.R.S., discoverer of oxygen, was minister here 1767-1773."
  },
  {
    "All Blue Plaques in Leeds": 26,
    "": "The Church Institute",
    "__1": "Albion Place, Leeds 1",
    "__2": "Private unveiling",
    "__3": 91,
    "__4": "The British Deaf Association",
    "__5": 430135,
    "__6": 433604,
    "__7": "The power house behind the advancement of religious and secular education on the principles of the Church of england in Leeds, and the home for a host of Church organisations. The British Deaf Association was founded here on 24th July 1890. Erected 1866-68"
  },
  {
    "All Blue Plaques in Leeds": 27,
    "": "Coloured Cloth Hall",
    "__1": "Cloth Hall Court, Infirmary Street, Leeds 1",
    "__2": "Mr D.F.L. Sykes, Senior Partner Hepworth & Chadwick, Solicitors",
    "__3": "16 May ‘91",
    "__4": "Hepworth & Chadwick, Solicitors",
    "__5": 429843,
    "__6": 433528,
    "__7": "This plaque has been removed. The circle where it once was is visible."
  },
  {
    "All Blue Plaques in Leeds": 28,
    "": "Fairbairn House",
    "__1": "71 Clarendon Road, Leeds 2",
    "__2": "Col. Alan Roberts, Pro-Chancellor, University of Leeds",
    "__3": "20 Jun ‘91",
    "__4": "University of Leeds",
    "__5": 428987,
    "__6": 434329,
    "__7": "Originally known as Woodsley House, this monumental villa was built in 1840 for Sir Peter Fairbairn, the textile engineering magnate, and mayor of Leeds 1858-59. Queen Victoria stayed here in 1858 when she came to open the Town Hall."
  },
  {
    "All Blue Plaques in Leeds": 29,
    "": "Atkinson Grimshaw",
    "__1": "56 Cliff Road, Hyde Park, Leeds 6",
    "__2": "Dr Tony Moyes at the request of Mrs Sandra Wood, great-granddaughter of Atkinson Grimshaw",
    "__3": "18 Jul ‘91",
    "__4": "Members of the Grimshaw family and North Hyde Park Neighbourhood Association",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 30,
    "": "John Harrison",
    "__1": "St John’s Churchyard Wall New Briggate, Leeds 1",
    "__2": "Professor Neville Rowell, Vice-President of Leeds Civic Trust",
    "__3": "29 Aug ‘91",
    "__4": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__5": 430270,
    "__6": 433810,
    "__7": "(1579-1656) St John's, one of England's most remarkable churches was built by this celebrated benefactor in 1634. A cloth merchant and co-founder of Leeds corporation, he further endowed the town with almshouses, a new grammar school and a market cross."
  },
  {
    "All Blue Plaques in Leeds": 31,
    "": "White Cloth Hall",
    "__1": "Crown Street, Leeds 1",
    "__2": "Mr D.J. Houghton, Managing Director, Speciality Shops plc",
    "__3": "24 Sept ‘91",
    "__4": "Speciality Shops plc",
    "__5": 430412,
    "__6": 433354,
    "__7": "This superbly restored gateway belonged to the magnificent quadrangular market hall which underpinned the prosperity of Georgian Leeds. Merchants and 1300 West Riding clothiers met here on Tuesdays and Saturdays to trade in undyed 'White' woollen cloth."
  },
  {
    "All Blue Plaques in Leeds": 32,
    "": "Joshua Tetley",
    "__1": "The Brewery Gates, Hunslet Road, Leeds 10",
    "__2": "Mr Charles Tetley, Great-grandson of Joshua Tetley",
    "__3": "29 Jan ‘92",
    "__4": "Joshua Tetley & Sons",
    "__5": 430365,
    "__6": 433042,
    "__7": "Joshua Tetley (1778-1859) In 1822, Joshua Tetley bought William Sykes Brewery business which had stood here since 1792. Joshua's enterprise and fine quality ales created a reputation which for ovwer 150 years made the name Tetley's synonymous with the city of Leeds."
  },
  {
    "All Blue Plaques in Leeds": 33,
    "": "Ralph Thoresby, FRS",
    "__1": "15 Kirkgate, Leeds 2",
    "__2": "Mr Arthur Elton, President of The Thoresby Society",
    "__3": "6 Oct ‘92",
    "__4": "The Thoresby Society",
    "__5": 430329,
    "__6": 433518,
    "__7": "(1658-1725) The Historian of Leeds had his home and museum here."
  },
  {
    "All Blue Plaques in Leeds": 34,
    "": "Arthur Ransome",
    "__1": "6 Ash Grove, Leeds 6",
    "__2": "Mr Norman Willis, General Secretary of the Trades Union Congress and longstanding member of the Arthur Ransome Society",
    "__3": "2 Mar ‘93",
    "__4": "Arthur Ransome Society",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 35,
    "": "Aire & Calder Navigation",
    "__1": "Riverside Court, Call Lane, Leeds 1",
    "__2": "Mr. Norman Stubbs, Chief Executive, Tay Homes",
    "__3": "20 Apr ‘93",
    "__4": "Tay Homes and British Waterways",
    "__5": 430344,
    "__6": 433226,
    "__7": "Before the railway age, the making navigable of the River Aire importantly made Leeds an inland port connected directly to Hull. Cheap water carriage was vital for the successful export of the cloth marketed and finished in the town. Opened 1700."
  },
  {
    "All Blue Plaques in Leeds": 36,
    "": "North-Eastern Railway Viaduct",
    "__1": "Swinegate end of the Viaduct, Leeds 1",
    "__2": "Mr. Gerald Egan, Leeds City Station Manager",
    "__3": "27 Apr ‘93",
    "__4": "Leeds Corporation and British Rail’s Community Unit",
    "__5": 430108,
    "__6": 433235,
    "__7": "This 1500 yard viaduct, including the New Station (now known as City Station) built over the river and canal, is one of the great feats of Victorian civil engineering. It linked railway termini on opposite sides of Leeds. Erected 1866-69."
  },
  {
    "All Blue Plaques in Leeds": 37,
    "": "Tower Works",
    "__1": "Tower Works, Globe Road, Leeds 12",
    "__2": "Mr Martin Eagland, Chief Executive, Leeds Development Corporation",
    "__3": "25 May ‘93",
    "__4": "Leeds Development Corporation",
    "__5": "",
    "__6": "",
    "__7": "Not found"
  },
  {
    "All Blue Plaques in Leeds": 38,
    "": "Samuel Smiles (1812-1905)",
    "__1": "Leeds Institute & Civic Theatre, Cookridge Street, Leeds 2",
    "__2": "Mr J. Olav Arnold, President, Leeds Civic Trust",
    "__3": "29 Mar ‘94",
    "__4": "Leeds & Holbeck Building Society",
    "__5": 429921,
    "__6": 434027,
    "__7": "The great propagandist of Victorian values through his books, 'Self-help', 'Character', 'Thrift', and 'Duty,' inspired by his lectures to Leeds working men in 1845. He worked in Leeds 1838-58 as a newspaper editor, doctor and then railway secretary."
  },
  {
    "All Blue Plaques in Leeds": 39,
    "": "Fletland Mills",
    "__1": "42, The Calls, Leeds 2",
    "__2": "Mr Keith Roberts, Secretary, The Bransby Agricultural Trading Association",
    "__3": "25 May ‘94",
    "__4": "Leeds Development Corporation and Jonathan Wix, the owner of 42 The Calls",
    "__5": 430526,
    "__6": 433259,
    "__7": "In 1887 Wright Bros., corn millers, acquired these late 18th and 19th century mills. They produced large quantities of flour and 'horse corn' for the Leeds district. In 1991 the buildings were splendidly converted to a high quality hotel."
  },
  {
    "All Blue Plaques in Leeds": 40,
    "": "Joseph Aspdin",
    "__1": "Packhorse Yard, between Lands Lane and Briggate, Leeds 1",
    "__2": "Sir George Mosley, Chairman, British Cement Association and    National Civic Trust",
    "__3": "21 Oct ‘94",
    "__4": "British Cement Association",
    "__5": 430166,
    "__6": 433580,
    "__7": "Portland Cement, one of mankind's most important manufactured materials, was patented by Joseph Aspdin, a Leeds Bricklayer, on 21 October 1824. Aspdin lived in this yard (then called Slip Inn Yard) and first sold his cement in Angel Inn Yard"
  },
  {
    "All Blue Plaques in Leeds": 41,
    "": "Yorkshire Ladies’ Council of Education",
    "__1": "18 Blenheim Terrace, Leeds 2",
    "__2": "The Lady Grimthorpe DCVO, Past President, Yorkshire Ladies’ Council of Education",
    "__3": "2 Mar ‘95",
    "__4": "Mr & Mrs Peter Hartley, Hillards Charitable Trust",
    "__5": "",
    "__6": "",
    "__7": "Was founded in 1876 to promote the education of girls and women and occupied this building between 1928-1988. It served as an administrative centre for Council activities and housed The Yorkshire Ladies' Secretarial College."
  },
  {
    "All Blue Plaques in Leeds": 42,
    "": "St Aidan’s Church",
    "__1": "St Aidan’s Church, Roundhay Road, Leeds 8",
    "__2": "Mr Noel Squires",
    "__3": "23 Apr ‘95",
    "__4": "Mr Noel Squires, Landlord of the New Roscoe Inn",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 43,
    "": "East Bar",
    "__1": "Leeds Parish Church, Kirkgate, Leeds 2",
    "__2": "Professor Neville Rowell. Vice-President of Leeds Civic Trust",
    "__3": "23 May ‘95",
    "__4": "Professor Neville Rowell",
    "__5": 430700,
    "__6": 433329,
    "__7": "This ancient stone marked the Eastern boundary of the medieval town of Leeds."
  },
  {
    "All Blue Plaques in Leeds": 44,
    "": "Sir Leonard Hutton",
    "__1": "On wall of the house at 5 Fulneck, Pudsey, Leeds 28",
    "__2": "Sir Lawrence Byford, President of Yorkshire County Cricket Club",
    "__3": "14 Oct ‘95",
    "__4": "Yorkshire County Cricket Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 45,
    "": "Leeds College of Art",
    "__1": "Leeds College of Art, Vernon Street, Leeds 2",
    "__2": "Sir Alan Bowness, former Director of The Henry Moore Foundation and former Director The Tate Gallery, son-in-law of Barbara Hepworth.",
    "__3": "5 Mar ‘96",
    "__4": "The Henry Moore Foundation",
    "__5": 429959,
    "__6": 434039,
    "__7": "Founded in 1846, by Leeds Mechanics' and Literary Institution, pioneered the teaching of practical art design in England and USA. Henry Moore and Barbara Hepworth studied here. This building was erected for the college in 1903."
  },
  {
    "All Blue Plaques in Leeds": 46,
    "": "First Leeds Synagogue",
    "__1": "Merrion Centre, Leeds 2",
    "__2": "Councillor Malcolm Bedford, Lord Mayor of Leeds",
    "__3": "8 Dec ‘96",
    "__4": "Mr Edward Ziff, Town Centre Securities",
    "__5": 430134,
    "__6": 433973,
    "__7": "This plaque was erected to commemorate the 150th anniversary of the opening of the first Leeds synagogue in 1846 in a converted house near this site in Back Rockingham Street."
  },
  {
    "All Blue Plaques in Leeds": 47,
    "": "City Varieties Music Hall",
    "__1": "The City Varieties, Swan Street, Leeds 1",
    "__2": "Mr Paul Daniels, Magician and TV celebrity",
    "__3": "27 Mar ‘97",
    "__4": "Friends of the City Varieties",
    "__5": 430216,
    "__6": 433716,
    "__7": "Harry Landler, Charlie Chaplin and Houdini performed in this music hall built in 1865 for Charles Thornton on the site of the white swan coaching inn. Famous venue of the \"Good Old Days,\" 1st broadcast in 1953."
  },
  {
    "All Blue Plaques in Leeds": 48,
    "": "Central Higher Grade School",
    "__1": "2 Great George Street, Leeds 1",
    "__2": "Councillor Suzi Armitage, Chair of Community Benefits & Rights Committee of Leeds City Council.",
    "__3": "16 Sept ‘97",
    "__4": "Leeds City Council",
    "__5": 430010,
    "__6": 433950,
    "__7": "This imposing school was erected by Leeds School board as the town's first local authority secondary school. Renamed City of leeds School in 1928, it merged with Thoresby High School in 1972, and moved to a new site in 1994. Opened 1889."
  },
  {
    "All Blue Plaques in Leeds": 49,
    "": "Leeds Union Workhouse",
    "__1": "Thackray Medical Museum, Beckett Street, Leeds 9",
    "__2": "Mr. Paul Thackray, Founder, Thackray Medical Museum",
    "__3": "11 Feb ‘98",
    "__4": "Thackray Medical Museum",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 50,
    "": "Oakwood Clock",
    "__1": "498 Roundhay Road, Leeds 8",
    "__2": "Sir James Savile, TV Celebrity and local resident",
    "__3": "7 Apr ‘98",
    "__4": "William H Brown Estate Agents",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 51,
    "": "Golden Acre Park",
    "__1": "On the outside wall of the café in Golden Acre Park at Otley Road, Leeds 16",
    "__2": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__3": "25 Aug ‘98",
    "__4": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 52,
    "": "Leeds Burial Ground",
    "__1": "Opposite  St. James’s Hospital, Beckett Street, Leeds 9",
    "__2": "Mrs Sylvia Barnard, Founder, Friends of Beckett Street Cemetery",
    "__3": "11 Sept ‘98",
    "__4": "Mr & Mrs David Kaye, Publishers of the Funeral Services Journal",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 53,
    "": "Leeds School Board",
    "__1": "Civic Court, Calverley Street, Leeds 1",
    "__2": "Councillor Graham Kirkland, Lord Mayor of Leeds",
    "__3": "2 Oct ‘98",
    "__4": "The Rushbond Group",
    "__5": 429804,
    "__6": 433862,
    "__7": "Erected this fine headquarters and examination centre in 1878 - 81. First elected by the ratepayers of Leeds in 1870, the board built sufficient schools to ensure that for the first time every child in Leeds received an elementary education."
  },
  {
    "All Blue Plaques in Leeds": 54,
    "": "Moortown Golf Club",
    "__1": "1 plaque on the Clubhouse and 1 on the  entrance gates at Mootown Golf Club, Harrogate Road, Leeds 17",
    "__2": "Mr Malcolm Tain, Club Captain",
    "__3": "11 Feb ‘99",
    "__4": "Moortown Golf Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 55,
    "": "Bank Mills",
    "__1": "Rose Wharf, East Street, Leeds 9",
    "__2": "Mr Gordon Carey RIBA, Chairman of Carey Jones Architects",
    "__3": "12 Mar ‘99",
    "__4": "Caddick Developments and Carey Jones, Architects",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 56,
    "": "Queen’s Arcade",
    "__1": "Briggate end of Queen’s Arcade, Leeds 1",
    "__2": "Councillor Keith Wakefield, Chair, Leeds City Council Development Service Group Committee",
    "__3": "28 Mar ‘99",
    "__4": "DTZ Debenham Thorpe",
    "__5": 430248,
    "__6": 433653,
    "__7": "Named in honour of Queen Victoria's Golden Jubilee. Built in 1888-9 by Armistead and Proctor on the site of the Rose and Crown coaching inn which occupied one of Briggate's medieval burgage plots. Architect: Edward Clark."
  },
  {
    "All Blue Plaques in Leeds": 57,
    "": "Meanwood Tannery",
    "__1": "Mill Pond Road, Off Monkbridge Road, Meanwood, Leeds 6",
    "__2": "Mr Fred Casperson and Mr Arthur Hopwood, distinguished local historians",
    "__3": "17 July ‘99",
    "__4": "Country & Metropolitan Homes Northern Ltd",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 58,
    "": "Burmantofts Pottery",
    "__1": "Gargrave Court, off Gargrave Approach, Leeds 9",
    "__2": "Mr. George Mudie, MP",
    "__3": "10 Dec ‘99",
    "__4": "Bramall Construction",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 59,
    "": "Potternewton Mansion",
    "__1": "Potternewton Mansion, Harehills Lane, Leeds 7",
    "__2": "Mr. Fabian Hamilton, MP",
    "__3": "1 Oct ‘99",
    "__4": "Park Lane College",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 60,
    "": "Victoria Quarter",
    "__1": "Victoria Quarter, between Vicar Lane and Briggate, Leeds 1",
    "__2": "Councillor Keith Parker, Lord Mayor of Leeds",
    "__3": "2-May-00",
    "__4": "The Prudential Insurance Company",
    "__5": 430335,
    "__6": 433640,
    "__7": "Was begun in 1900 with the opening of Frank Matcham's splendid County and Cross arcades. Enhanced by covering Queen Victoria's Street, the site was formerly medieval yards, Georgian shambles and slaughter houses. Leeds 2000."
  },
  {
    "All Blue Plaques in Leeds": 61,
    "": "William Congreve",
    "__1": "Bardsey Grange, Cornmill Lane, Bardsey, Leeds 17",
    "__2": "Mrs Bridget Ely (nee Congreve) and Councillor David Congreve, relatives of William Congreve",
    "__3": "8-Jul-00",
    "__4": "Councillor David Hudson who represents Wetherby District on Leeds City Council",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 62,
    "": "Leeds Town Hall (Millennium Blue Plaque)",
    "__1": "Inside  the Calverley Street entrance of the Town Hall, Leeds 1",
    "__2": "Councillor Bernard Atha OBE, Lord Mayor of Leeds",
    "__3": "27-Nov-00",
    "__4": "Professor Neville Rowell, Vice-President, Leeds Civic Trust",
    "__5": 429787,
    "__6": 433866,
    "__7": "This greatest of monuments to Victorian municipal government was opened by Queen Victoria on 7 September 1858. Its architect, Cuthbert Brodrick, created a civic palace with courts, council chamber, mayor's parlour, offices, bridewell and concert hall, the"
  },
  {
    "All Blue Plaques in Leeds": 63,
    "": "Kirkgate Market",
    "__1": "Vicar Lane end of Butchers’ Row, Kirkgate Market, Leeds 2",
    "__2": "Mr. Richard Wainwright, formerly Liberal MP for Colne Valley",
    "__3": "14-Dec-00",
    "__4": "Richard Wainwright",
    "__5": 430467,
    "__6": 433539,
    "__7": "In 1826 the Leeds Vicaridge and Croft were purchased to create a fruit, vegetable and cattle market. An elegant Crystal Palace-style covered market was erected in 1857, followed in 1904 by today's magnificent market hall designed by Leeming & Leeming."
  },
  {
    "All Blue Plaques in Leeds": 64,
    "": "Montague Burton",
    "__1": "Hudson Road, Leeds 9",
    "__2": "Mr Arnold Burton and Mr Raymond Burton, the twin sons of Sir Montague Burton",
    "__3": "30 Mar ‘01",
    "__4": "The Burton Family",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 65,
    "": "Kirkstall Brewery",
    "__1": "Broad Road, Leeds 5",
    "__2": "Private unveiling",
    "__3": 1,
    "__4": "Leeds Metropolitan University",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 66,
    "": "Cliff Tannery",
    "__1": "Near the entrance to Sugarwell Court, Meanwood Road, Leeds 7",
    "__2": "Private unveiling",
    "__3": 1,
    "__4": "Leeds Metropolitan University",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 67,
    "": "The Philosophical Hall",
    "__1": "HSBC Bank, Park Row, Leeds 1",
    "__2": "Dr Peter Evenett, President Leeds Philosophical and Literary Society",
    "__3": "28 Jun ‘01",
    "__4": "Leeds Philosophical and Literary Society",
    "__5": 429922,
    "__6": 433523,
    "__7": "The imposing home of the Leeds Philisophical and Literary Society stood here until 1966. erected in 1821, it became the centre of scientific and cultural life in Leeds housing a fine museum conveyed to the City in 1921."
  },
  {
    "All Blue Plaques in Leeds": 68,
    "": "Smithfield Ironworks",
    "__1": "90 – 94, North Street Leeds 2",
    "__2": "Councillor David Hudson, Lord Mayor of Leeds",
    "__3": "15 Jul ‘01",
    "__4": "Road Roller Association",
    "__5": 430590,
    "__6": 434110,
    "__7": "Built as the Smithfield Hotel in the 1860's to serve Leeds cattle Market opposite, it later became the imposing frontage of Thomas Green at Son Ltd. Green made steam and motor rollers, traction engines, steam trams, railway locomotives and grass cutting machines."
  },
  {
    "All Blue Plaques in Leeds": 69,
    "": "The Grange",
    "__1": "Beckett Park, Leeds 16",
    "__2": "Private unveiling",
    "__3": "Oct-01",
    "__4": "Leeds Metropolitan University",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 70,
    "": "Permanent House",
    "__1": "Brown’s Restaurant, ‘The Light’, The Headrow, Leeds 1",
    "__2": "Dr. Arnold Ziff, OBE A former President of the Leeds Permanent Building Society",
    "__3": "16 Jan ‘02",
    "__4": "Brown’s Restaurant",
    "__5": 429941,
    "__6": 433804,
    "__7": "Was built on the newly created Headrow in 1930 as the headquarters of Leeds Permanent Building Society. Its grandeur befitted Leeds' greatest financial institution which from 1848 enabled generations to fulfil the dream of buying their own home. Architect G.W.Atkinson."
  },
  {
    "All Blue Plaques in Leeds": 71,
    "": "Ellen Heaton",
    "__1": "Swarthmore Education Centre, 6 Woodhouse Square, Leeds 3",
    "__2": "Ms. Rommi Smith Poet, performer and teacher.",
    "__3": "27 Feb ‘02",
    "__4": "Friends of Swarthmore Education Centre and  Little Woodhouse Community Association",
    "__5": 429314,
    "__6": 433990,
    "__7": "Lived in 6 Woodhouse Square from 1859-94. She was an influential Pre-Raphaelite art patron and an active campaigner for women's rights, education, health, environmental issues and anti-vivisection. Her friend, the poet Christina Rossetti, stayed here."
  },
  {
    "All Blue Plaques in Leeds": 72,
    "": "Leeds Civic Hall",
    "__1": "Millennium Square, Portland Crescent, Leeds 1",
    "__2": "Mr. George Williamson, apprentice joiner, who worked on the construction of the Civic Hall",
    "__3": "10 Jun ‘02",
    "__4": "Leeds City Council",
    "__5": 429864,
    "__6": 434086,
    "__7": "Was erected 1930-33 by the unemployed accomodation, includes Lord mayor's ceremonial rooms, Council Chamber, committee rooms and offices. It was built to serve the 'ever expanding municipal functions and duties' of Leeds City Council. Architect: Vincent H"
  },
  {
    "All Blue Plaques in Leeds": 73,
    "": "E J Arnold& Son Ltd",
    "__1": "3, Lower Briggate, Leeds 1",
    "__2": "Mr. J. Olav Arnold and Mr.  Martin Arnold, great-grandsons of Edward James Arnold",
    "__3": "3 Jul ‘02",
    "__4": "J. Olav Arnold and Family",
    "__5": 430237,
    "__6": 433243,
    "__7": "Britain's leading educational suppliers and printers was established in this Georgian merchant's house No.3 Briggate in 1870. Its warehouse and factory was in Blayd's yard."
  },
  {
    "All Blue Plaques in Leeds": 74,
    "": "Leeds Grammar School",
    "__1": "Moorland Road Leeds 6",
    "__2": "Councillor Bryan North, Lord Mayor of Leeds with pupils Sam Best and Daniel Saffer",
    "__3": "7 Oct ‘02",
    "__4": "Leeds Grammar School",
    "__5": 429030,
    "__6": 434740,
    "__7": "Was founded in 1552 by Wiliam Sheafield, chantry priest, Leeds Parish Church. It Occupied this building from 1859 to 1997. Famous pupils include; John Smeaton, engineer, G. Studdert Kennedy, 'Woodbone Willie', chaplain; John Ireland, composer; Field Marsh."
  },
  {
    "All Blue Plaques in Leeds": 75,
    "": "John Deakin Heaton",
    "__1": "‘Claremont’, 23 Clarendon Road, Leeds 2",
    "__2": "Professor Maurice Beresford, Emeritus Professor of Economic History, Leeds University.",
    "__3": "30 Oct ‘02",
    "__4": "Yorkshire Archaeological Society and Mrs I. A. J.  Moses",
    "__5": 429228,
    "__6": 434093,
    "__7": "Eminent physician lived at Claremont a Georgian merchant's villa, from 1856 -80 he was a prime mover in the campaign for Leeds Town Hall, and played major roled in the development of the Leeds General Infirmary and the Yorkshire College, later the University of Leeds."
  },
  {
    "All Blue Plaques in Leeds": 76,
    "": "Sir Berkeley Moynihan (1865-1936)",
    "__1": "33 Park Square, Leeds 1",
    "__2": "Dr C. B. Wynn Parry, grandson of Sir Berkeley Moynihan",
    "__3": "27 Jan ‘03",
    "__4": "The Faculty of the  General Infirmary at Leeds",
    "__5": 429555,
    "__6": 433764,
    "__7": "Inspirational teacher and pioneer in abdominal surgery had his consulting rooms here from 1893-1930. He introduced the wearing of rubber gloves and prized 'caressing the tissues' rather than speed in surgery. President of the Royal College of Surgeons 1920's."
  },
  {
    "All Blue Plaques in Leeds": 77,
    "": "Samuel Ledgard",
    "__1": "Nelson Inn, Armley Road, Leeds 12",
    "__2": "Councillor Michael Fox, Deputy Lord Mayor of Leeds",
    "__3": "15 Apr ‘03",
    "__4": "Samuel Ledgard Society and the  Ledgard Family",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 78,
    "": "Frank Kidson",
    "__1": "5 Hamilton Avenue,  Leeds 7",
    "__2": "Dr Vic Gammon, Chairman of Frank Kidson Memorial Fund and Senior Lecturer in Popular & World Music, Leeds University.",
    "__3": "20 May ‘03",
    "__4": "Frank Kidson Memorial Fund",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 79,
    "": "Mann’s Patent Steam Cart & Wagon Company Ltd",
    "__1": "Pepper Road, Hunslet, Leeds 10",
    "__2": "Councillor Neil Taggart, Lord Mayor of Leeds",
    "__3": "15 Jun ‘03",
    "__4": "The Leeds & District Traction Engine Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 80,
    "": "Yorkshire Patent Steam Wagon Company",
    "__1": "Pepper Road, Hunslet Leeds 10.",
    "__2": "Councillor Neil Taggart, Lord Mayor of Leeds",
    "__3": "15 Jun ‘03",
    "__4": "The Leeds & District Traction Engine Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 81,
    "": "Newton House",
    "__1": "54, Spencer Place Leeds 7",
    "__2": "Mrs. Jean White, former Deputy Lord Mayor of Leeds",
    "__3": "10 Sept ‘03",
    "__4": "Angel Group plc",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 82,
    "": "The Hunslet Engine Company",
    "__1": "125 Jack Lane, Hunslet, Leeds 10",
    "__2": "Councillor Neil Taggart, Lord Mayor of Leeds",
    "__3": "21 Sept ‘03",
    "__4": "Don Townsley, a former executive of the Company",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 83,
    "": "Dewhirst’s and Marks & Spencer",
    "__1": "Harper Street, Leeds 2",
    "__2": "Mr. Timothy Dewhirst, Deputy Lord Lieutenant of the East Riding of Yorkshire, Chairman of DewhirstGroup Ltd, and great-grandson of Mr. Isaac Dewhirst?",
    "__3": "21 Oct ‘03",
    "__4": "Urban Edge Group",
    "__5": 430535,
    "__6": 433416,
    "__7": "This was the warehouse of Isaac Dewhirst, wholesale haberdasher and manufacturer of hoisery, pinafores, underclothing and aprons. Obtaining supplies here, the polish immigrant pedlar, Michael Marks, met Dewhirst's cashier Tom Spencer. In 1894 they formed the Department Store Marks & Spencers."
  },
  {
    "All Blue Plaques in Leeds": 84,
    "": "Bardon Hill Stables (Access only on foot around security gates)",
    "__1": "Weetwood Lane,  Leeds 16",
    "__2": "Mrs. Jacky Banyard,  Sales and Marketing Director, CALA Homes (Yorkshire) Ltd.",
    "__3": "20 Nov ‘03",
    "__4": "CALA Homes (Yorkshire) Ltd",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 85,
    "": "Cookridge Hall",
    "__1": "Cookridge Lane, Leeds16",
    "__2": "Mr. Don Cole, Cookridge Historian",
    "__3": "28 Nov ‘03",
    "__4": "Trustees of Kirke’s Charity, Esporta Health and Fitness Club, and Leeds City Council.",
    "__5": "",
    "__6": "",
    "__7": "Inspirational teacher and pioneer in abdominal surgery had his consulting rooms here from 1893-1930. He introduced the wearing of rubber gloves and prized 'caressing the tissues' rather than speed in surgery. President of the Royal College of Surgeons 1920's"
  },
  {
    "All Blue Plaques in Leeds": 86,
    "": "Sir John Barran MP",
    "__1": "Joseph’s Well, Hanover Walk, Leeds 3.",
    "__2": "Mr. Brian Walker, former Leader of Leeds City Council",
    "__3": "4 Dec ‘03",
    "__4": "J Pullan & Sons Ltd",
    "__5": 429384,
    "__6": 433946,
    "__7": "Pioneered the leeds ready made clothing industry ubn the 1850s, introducing the band knife for cutting multiple layers of cloth. In 1887 he this factory to his others in Park Square. As mayor he secured the purchase of Roundhay Park for Leeds."
  },
  {
    "All Blue Plaques in Leeds": 87,
    "": "The Middleton Railway",
    "__1": "Moor Road Station, Hunslet, Leeds 10",
    "__2": "Councillor Neil Taggart, Lord Mayor of Leeds",
    "__3": "27 Mar ‘04",
    "__4": "Middleton Railway Trust",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 88,
    "": "Denison Hall",
    "__1": "Hanover Square, Little Woodhouse, Leeds 3",
    "__2": "Mrs. Freda Matthews, Little Woodhouse Community Campaigner",
    "__3": "15 May ‘04",
    "__4": "Tandridge Investments Ltd",
    "__5": 429140,
    "__6": 434058,
    "__7": "The grandest house ever built in central Leeds was erected in 101 days for John Wilkinson upon inheriting the fortune of his uncle, the cloth merchant, Robert Denison. Its parkland setting reflected his desire for the country gentleman's lifestyle for whi"
  },
  {
    "All Blue Plaques in Leeds": 89,
    "": "Olympia Works and Robert Blackburn",
    "__1": "Tesco Supermarket, 361, Roundhay Road,  Leeds 8",
    "__2": "Professor Robert Blackburn, grandson of Robert Blackburn the aviation pioneer.",
    "__3": "26 May ‘04",
    "__4": "Philip Snaith",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 90,
    "": "Leeds & County Liberal Club",
    "__1": "Quebecs Hotel, Quebec Street, Leeds 1",
    "__2": "Mrs Joyce Wainwright, widow of Richard Wainwright, Liberal MP for the Colne Valley",
    "__3": "13 July ‘04",
    "__4": "The Wainwright family",
    "__5": 429773,
    "__6": 433474,
    "__7": "From parliamentary and municipal reform in the 130's to 1894 the Liberal party dominated politics in Leeds. This splendid club in Welsh terracotta opened in 1891. Crowds were addressed from its balcony, 'on occasions of political excitement .' Arhitects:"
  },
  {
    "All Blue Plaques in Leeds": 91,
    "": "The Leeds Club",
    "__1": "3 Albion Place, Leeds 1",
    "__2": "Councillor Christopher Townsley, Lord Mayor of Leeds",
    "__3": "8 Dec ‘04",
    "__4": "Mr. Bob Isle,Honorary Secretary of The Leeds Club",
    "__5": 430107,
    "__6": 433605,
    "__7": "Moved here in 1852. As a prestigous gentlemen's club, it was the meeting place for the town's leading business and professional men. Its lavish classical interior included coffee, smoking and dining rooms, a billiard room, bedrooms and a ballroom. Founded"
  },
  {
    "All Blue Plaques in Leeds": 92,
    "": "Mount St Mary’s Convent, Orphanage & School",
    "__1": "Mount St Mary’s Catholic High School, Ellerby Road, Leeds 9",
    "__2": "Mrs Helen Kennally, Author of the History of the Convent, Orphanage & School Mount St Mary’s Schools Leeds 1853-2003",
    "__3": "26 Jan ‘05",
    "__4": "Mount St Mary’s Catholic High School",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 93,
    "": "Headingley Hall",
    "__1": "Headingley Hall, 5, Shire Oak Road, Leeds 6",
    "__2": "Councillor William S Hyde, Lord Mayor of Leeds and the Lady Mayoress, Mrs. Patricia Hyde.",
    "__3": "8 Jun ‘05",
    "__4": "Westward Care (Yorkshire) Ltd",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 94,
    "": "Canal Gardens",
    "__1": "Canal Gardens, on the archway leading to Tropical World, Princes Avenue, Leeds 8",
    "__2": "Mrs Marjorie Ziff, President of the Friends of Roundhay Park",
    "__3": "21 Jun ‘05",
    "__4": "Friends of Roundhay Park",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 95,
    "": "Dr ‘Alister’ MacKenzie",
    "__1": "The Corner House Club, 266 Lidgett Lane, Leeds 17",
    "__2": "Mr. J  Olav Arnold, President of Leeds Civic Trust and playing member of Alwoodley Golf Club for over 60 years",
    "__3": "27 Jun ‘05",
    "__4": "Jointly: Alwoodley Golf Club and Moortown Golf Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 96,
    "": "Richard Oastler",
    "__1": "The Wardrobe, St Peter’s Square, Leeds 9",
    "__2": "Councillor Andrew Carter, Deputy Leader, Leeds City Council, with the assistance of pupils from Fulneck School.",
    "__3": "6 Sept ‘05",
    "__4": "Professor Neville Rowell Vice-President, Leeds Civic Trust",
    "__5": 430813,
    "__6": 433524,
    "__7": "The Factory King' was born in St Peter's Square. His 1830 letter to the Leeds Mercruy about 'Yorkshire Slavery' began the campaign to reduce the working day of factory children to ten hours. The Ten Hours Act of 1847 owed much to his persuasive writing and compelling oratory. 1789- 1861"
  },
  {
    "All Blue Plaques in Leeds": 97,
    "": "John Smeaton FRS",
    "__1": "On the towpath wall at Leeds Lock, Royal Armouries, Leeds 10",
    "__2": "Mr. John McKenzie, President of the Smeatonian Society of Civil Engineers",
    "__3": "6 Oct ‘05",
    "__4": "Smeatonian Society of Civil Engineers",
    "__5": 430895,
    "__6": 432976,
    "__7": "Was born and lived at Austhorpe Lodge, Whitkirk, Leeds. He developed scientific methods to harness better the water, wind and steam power essential to the Industrial Revolution. He was consulted nationally on the design of mills, harbours, bridges and waterways, including the Aire and Calder Navigation. He was most famous for designing and building the third Eddystone Lighthouse. The creation of the Smeatonian Society  of Civil Engineers (1771) gave rise to the professional engineering institutions. 1724-1792"
  },
  {
    "All Blue Plaques in Leeds": 98,
    "": "Sir Clifford Allbutt",
    "__1": "Lyddon Hall, University of Leeds Campus Leeds 2",
    "__2": "Dr John Wales MD, FRCP, retired Consultant Physician and past Chairman of the Faculty at the General Infirmary at Leeds",
    "__3": "7 Dec ‘05",
    "__4": "The Faculty at the  General Infirmary at Leeds.",
    "__5": 429290,
    "__6": 434514,
    "__7": "One of the most widely consulted physicians of his era lived here 1872-81. He was a physician at LGI 1864-84 and later Regius Professor of Physic at Cambridge. He is best known for inventing the short-stemmed clinical thermometer and revising 'The System of Medicine,' the doctor's bible. 1836-1925."
  },
  {
    "All Blue Plaques in Leeds": 99,
    "": "Leeds General Cemetery",
    "__1": "Gatehouse, St George’s Field, University of Leeds, Leeds 2",
    "__2": "Dr Julie Rugg, a senior research fellow at York University and head of the Cemetery Research Group",
    "__3": "24 Apr ‘06",
    "__4": "Mr and Mrs David Kaye",
    "__5": "",
    "__6": "",
    "__7": "Moved here in 1852. As a prestigous gentlemen's club, it was the meeting place for the town's leading business and professional men. Its lavish classical interior included coffee, smoking and dining rooms, a billiard room, bedrooms and a ballroom. Founded"
  },
  {
    "All Blue Plaques in Leeds": 100,
    "": "Whitelocks",
    "__1": "Whitelocks Public House, Turks Head Yard, Off Briggate, Leeds 1",
    "__2": "Miss  Sarah Whitelock, great great granddaughter of John Lupton Whitelock, landlord and licensee in 1867.",
    "__3": "23 May ‘06",
    "__4": "Leeds Civic Trust",
    "__5": 430196,
    "__6": 433529,
    "__7": "Occupying a medieval Briggate burgage plot. It was first licensed as the Turk's Head in 1715.  Rebuilt by the Whitelock family in the 1880s, it later extended into the rom of Georgian working mens cottages. John Betjeman described it as 'the very heart of Leeds'."
  },
  {
    "All Blue Plaques in Leeds": 101,
    "": "Richard Bentley FRS DD",
    "__1": "Bentley Square, Calverley Rd, Oulton, Leeds 26",
    "__2": "Mr Malcolm Brocklesby, Vice-Chairman of the Oulton Society",
    "__3": "7 Jun ‘06",
    "__4": "The Oulton Society",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 102,
    "": "Live at Leeds",
    "__1": "University of Leeds Refectory, University of Leeds Campus Leeds 2",
    "__2": "Mr. Pete Townshend and Mr. Roger Daltry, surviving members of The Who’s original line-up at their famous concert on 14th February 1970",
    "__3": "17 Jun ‘06",
    "__4": "University of Leeds",
    "__5": 429332,
    "__6": 434599,
    "__7": "Live At Leeds The University refectory is a legendary concert venue. The Who’s Performance here on 14th February was recorded and released as ‘Live at Leeds,’ the most celebrated live album of its’ generation."
  },
  {
    "All Blue Plaques in Leeds": 103,
    "": "The Leeds Rifles",
    "__1": "Carlton Barracks, Carlton  Lane, Leeds 7",
    "__2": "Dr. Ingrid Roscoe, HM Lord Lieutenant for West Yorkshire",
    "__3": "8 Nov ‘06",
    "__4": "Reserve forces and Cadets Association for Yorkshire and the Humber",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 104,
    "": "Leeds Co-operative Society",
    "__1": "Gatepost at entrance to Leodis Court (opp. Temple Mill)",
    "__2": "David Schofield, past President of the Leeds Co-operative Society",
    "__3": "1-Mar-07",
    "__4": "Leeds Co-operative Society",
    "__5": 429585,
    "__6": 432735,
    "__7": "Was founded in 1847 when workers at Holbeck's Benyon and Co flax-spinning mill initiated the raising of funds in instalments from working-class families to rent a mill on this site. 'The People's Mill' provided them with wholesome reasonably-prices flour. By 2007, co-operatives have spread worldwide with 700 million members - but Leeds Co-operative Society was still the oldest in existence."
  },
  {
    "All Blue Plaques in Leeds": 105,
    "": "Leonora Cohen JP OBE",
    "__1": "2 Claremont Villas, Clarendon Road, LS3",
    "__2": "Michael Meadowcroft, Chairman of the Electoral Reform Society 1989-1993",
    "__3": "6-Jun-07",
    "__4": "Various individual sponsors",
    "__5": 429263,
    "__6": 434072,
    "__7": "Leading Suffragette famous for smashing a showcase in the Jewel House at the Tower of London and for her hunger strike at Armley Gaol in 1913. Lived here between 1923-1936. Lived 1873-1978"
  },
  {
    "All Blue Plaques in Leeds": 106,
    "": "J & H McLaren’s Midland Engine Works",
    "__1": "Equinox Designs Ltd, 100 Jack Lane, Hunslet, LS10",
    "__2": "The Lord Mayor of Leeds, Councillor Brian Cleasby",
    "__3": "17-Jun-07",
    "__4": "The Leeds & District Traction Engine Club",
    "__5": "",
    "__6": "",
    "__7": ""
  },
  {
    "All Blue Plaques in Leeds": 107,
    "": "The Leeds Library",
    "__1": "18 Commercial Street, Leeds,  LS1  6AL",
    "__2": "Deputy Lord Mayor of Leeds, Councillor Alan Taylor",
    "__3": "6-Sep-07",
    "__4": "Member of the Library remaining anonymous.",
    "__5": 430104,
    "__6": 433552,
    "__7": "A proprietary subscription library founded in 1768 with Joseph Priestley as secretary. Since 1808 it has occupied these purpose-built premises designed by Thomas Johnson. The first floor reading room and Thomas Ambler's 'New Room' extension are amongst the architectual wonders of Leeds."
  }
]